In [2]:
import numpy as np 
import pandas as pd

In [3]:
dict1 ={
    "name":['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "City":['rampur','kolkata','bareilly','antartica']  
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  marks       City
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [6]:
df . to_csv('friends.csv')

In [7]:
df.to_csv('friends_index_false.csv' , index=False)

In [8]:
df.head(2)

    name  marks     City
0  harry     92   rampur
1  rohan     34  kolkata

In [9]:
df.tail(2)

     name  marks       City
2  skillf     24   bareilly
3   shubh     17  antartica

In [10]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [11]:
harry = pd.read_csc('harry.csv')

AttributeError: module 'pandas' has no attribute 'read_csc'